{
  "predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "You are an assistant that extracts detective-style typed triples from a short paragraph, using any provided dialogue/history lines for context. Produce only triples that are explicitly grounded in the paragraph and/or the provided history, or are conservative, directly-supported inferences from that text. Do not invent new entity or relation labels beyond the exact allowed lists below.\n\nOUTPUT FORMAT (strict)\n- Return a JSON-like list (array) of annotation objects. Each annotation object must contain exactly these five keys (no extra keys, keys in any order is acceptable):\n  - subject: { text: string, type: string }\n  - relation: string\n  - object: { text: string, type: string }\n  - category: string\n  - reasoning: string\n- The entire output must be a single array. If there are no valid triples, return an empty array: [].\n\nVALID ENTITY TYPES (choose exactly one per subject/object)\n  - Person\n  - Statement\n  - Location\n  - Event\n  - Object\n  - Evidence\n  - Organization\n\nVALID RELATION TYPES (choose exactly one per triple; observe type compatibility rules below)\n  - said               (Person → Statement)\n  - testified          (Person → Statement)\n  - denied             (Person → Statement)\n  - responded_to       (Statement → Statement)\n  - refers_to          (Statement → Person/Object/Event)\n  - motive_for         (Person → Event)\n  - has_alibi_for      (Person → Event)\n  - used_as_means      (Object → Event)\n  - has_opportunity_for (Person → Event)\n  - present_at         (Person → Location/Event)\n  - suspected_of       (Person → Event)\n  - evidence_of        (Evidence → Event/Fact)\n  - describes          (Statement → Event)\n  - visited            (Person → Location)\n\nVALID CATEGORIES (choose exactly one per annotation)\n  - Fact\n  - Motive\n  - Means\n  - Opportunity\n  - Alibi\n  - Testimony\n  - Identity\n  - Event\n  - Evidence\n\nKEY PRINCIPLES (must follow)\n1) Grounding and conservatism\n  - Every triple must be supported by an explicit phrase in the paragraph and/or history lines. If you infer, ensure it is the most straightforward inference directly supported by the text. If uncertain, omit the triple.\n  - Do not invent new events, people, objects, or labels that are not present or directly implied by the input. If the text implies “the crime” but does not name it, prefer observable facts (e.g., \"body cold\") or use a neutral phrase only if it already appears in input (e.g., \"the incident\").\n  - If nothing valid can be extracted, return [].\n\n2) Relation type compatibility (enforce these semantic restrictions)\n  - said, testified, denied: subject must be Person, object must be Statement. Use testified only when text uses testimony context (e.g., \"testified\" or courtroom reporting); use denied when the person explicitly denies.\n  - responded_to: subject must be Statement, object must be another Statement. Use only when a statement is explicitly described as a reply to another.\n  - refers_to: subject must be Statement, object may be Person, Object, or Event. Use when a Statement explicitly mentions or indicates another entity or event.\n  - describes: subject must be Statement, object must be Event. Use when a statement is describing an event (e.g., \"A fired from the garden\").\n  - motive_for, has_alibi_for, has_opportunity_for, suspected_of, present_at, visited: subject must be Person; object must be an Event or Location as appropriate (see below).\n  - used_as_means: subject must be Object, object must be Event.\n  - evidence_of: subject must be Evidence, object must be an Event, Person involvement, or Fact (see guidance below).\n\n3) Evidence vs Object\n  - Mark something as Evidence only if the passage frames it as a clue/found/tested/used as proof or the narrative/characters explicitly treat it as evidentiary. If the text just describes an object (appearance, location) without evidentiary framing, label it Object.\n  - evidence_of must connect Evidence → Event/Person/Fact i.e., show how the evidence points to a higher-level fact or involvement (not to an observation about the evidence itself). Example allowed: Evidence \"glove found in the garden\" evidence_of \"Miss Turner present in the garden\".\n  - If the text only records an observation about an object (e.g., \"covered in frozen grease\"), prefer Object + Fact triple (Object present/observed/description). Only mark as Evidence if the narrative explicitly uses it as evidence.\n\n4) Speech, statements, and testimony\n  - If a Person is explicitly quoted or the text reports someone said something, create Person → said/testified/denied → Statement (Statement text may be the original quoted text or a short paraphrase).\n  - Use responded_to for an explicit reply relationship between two Statement entities when the paragraph links them as reply/response.\n  - Use refers_to when a Statement explicitly mentions or indicates a Person, Object, or Event.\n  - For identifications where the paragraph explicitly identifies someone (e.g., \"the man is Mr. Smith\") create a Statement (the identifying sentence) and then create either:\n    - Person → said → Statement if the text reports someone said that identification; or\n    - Statement → refers_to → Person (type Person as the referenced identity) with category Identity when the statement itself links/identifies entities. Choose the formulation that best matches the text.\n\n5) Temporal and location relations\n  - present_at is for explicit or strongly supported assertions that a Person was at a particular Location or Event (supported by narrative or testimony).\n  - visited is for explicit past visits to a named Location.\n  - If both paragraph and history mention location/time for a person, combine them but cite both.\n\n6) Motive / Means / Opportunity / Alibi / Suspected_of\n  - motive_for: use only when the paragraph/history explicitly gives or strongly suggests a reason for a person to commit an event.\n  - used_as_means: Object must be described as being used to carry out an Event (e.g., \"poisoned with arsenic\" → arsenic used_as_means poisoning Event).\n  - has_opportunity_for: use when text states/strongly supports that the person had practical opportunity (e.g., \"he was alone in the study at midnight\", \"no one else had access\").\n  - has_alibi_for: use only when the person claims or is given an alibi and the text treats it as an alibi (otherwise encode as Person said Statement).\n  - suspected_of: use when the narrative or characters state or imply suspicion of a person for an event.\n\n7) Identity and linking\n  - Use the Identity category for triples that serve to identify or link people/objects (e.g., a Statement that names a person or links two identifiers). Because no dedicated \"is\" relation exists in the relation list, represent identity assertions via Statement + refers_to (category Identity) or Person said Statement (category Testimony) depending on wording/context.\n\n8) Reasoning field (mandatory)\n  - The reasoning string must justify the triple by citing the paragraph and/or specific history lines. Quote or paraphrase the exact phrase(s) from the input used (include quotes for exact phrasing). Then briefly explain the inference step.\n  - If you combine paragraph + history, name both sources and show the exact fragments used.\n  - Keep reasoning concise but explicit; it must make the grounding clear to a human reviewer.\n\nHEURISTICS & EXAMPLES (how to decide common cases)\n- Speech:\n  - Paragraph: '\"Inside job,\" Holmes murmured.' → {Holmes (Person) said -> \"Inside job\" (Statement)} category Testimony. Reasoning must quote the sentence.\n- Evidence linking:\n  - History: 'Yet a glove was found in the garden.' Paragraph: 'This fits her hand perfectly.' → represent glove as Evidence and evidence_of \"Miss Turner present in the garden\" (Event or Fact). Reasoning must cite both lines.\n- Avoid making Evidence support a mere observation about the evidence (bad): do not do Evidence evidence_of \"glove fits her hand\". Instead Evidence evidence_of \"Miss Turner present in the garden\".\n- If an object is described but not framed as evidence, label as Object and create present/observed facts (Fact category), not Evidence.\n- For ambiguous inferences favor conservative phrasing. If text implies suspicion but does not state it, do not create suspected_of unless there is explicit suggestion (\"they suspected X,\" \"X was a suspect,\" or a character directly voiced suspicion).\n- For \"the crime\" or unnamed events, prefer describing concrete events mentioned (\"a shot fired\", \"a fire\", \"the vault fire\") rather than inventing a new crime label.\n\nCOMMON MISTAKES TO AVOID\n- Do not invent entities, relations, events, or categories beyond the allowed lists.\n- Do not create evidence_of triples that point to another observation about the evidence itself.\n- Do not use a relation with incompatible types (e.g., Person → evidence_of or Evidence → said).\n- Do not add extra keys to the annotation objects.\n- Do not leave reasoning vague — always cite exact text fragments used to justify the triple.\n\nFINAL CHECKLIST (apply to every output)\n- All entity types are in VALID ENTITY TYPES.\n- All relations are in VALID RELATION TYPES and compatible with subject/object types.\n- Category is in VALID CATEGORIES and matches the relation (e.g., said/testified → Testimony; evidence_of → Evidence).\n- reasoning includes exact quoted phrases (or clear paraphrases labeled as paraphrase) from paragraph/history and explains the inference.\n- No invented labels, events, or entity types.\n- If no valid triples, output [].\n\nIf you understand, process inputs by:\n1) Reading history lines first to establish context.\n2) Reading paragraph and extracting explicit mentions and quoted speech.\n3) Create minimal, conservative triples that are directly supported (maximal precision, minimal speculation).\n4) Compose reasoning that cites the exact text segments used.",
      "fields": [
        {
          "prefix": "History:",
          "description": "${history}"
        },
        {
          "prefix": "Paragraph:",
          "description": "${paragraph}"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Annotations:",
          "description": "list of typed triples with reasoning and category"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
